Repository: hjelev/bg-trackers
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: bg

source: New torrents sorted by IMDB
bg: Нови торенти подредени по IMDB оценка

source: 404 Not Found Error
bg: 404 Страницата не е намерена

source: The page you are looking for was not found!
bg: Страницата която търсите не е намерена!

source: Something went wrong!
bg: Нещо стана ;-(

source: BG Torrents Mix
bg: Търсачка за торенти

source: Here you'll find the latest movies and TV serials from the most popular Bulgarian torrent trackers - Arenabg.com, Zamunda.net, Zelka.org, P2pbg.com, Energy-torrent.com and Alein.org.<br /> We list only movies with Bulgarian subtitles or audio. All the movies are sorted by IMDB Rating and can be filtered by genre and year.
bg: Тук ще намерите най-новите филми и ТВ сериали от най-популярните Български торент сайтове - Arenabg.com, Zamunda.net, Zelka.org, P2pbg.com, Energy-torrent.com and Alein.org.<br /> Каталогът съдържа само филми с Български субтитри или озвучаване - сортиран е по imdb оценка и може да се филтрира по жанр и година.

source: Movies Found Today
bg: Филма намерени днес

source: Movies from 2018
bg: Филма от 2018 г.

source: TV Series
bg: ТВ Сериали

source: DB was generated on
bg: Базата е обновена на

source: BG Torrents
bg: БГ Торенти

source: New Movies
bg: Нови Филми

source: from
bg: от

source: Movies found today.
bg: Филми намерени днес

source: Filter by Genre
bg: Филтрирай по Жанр

source: All
bg: Всички

source: Filter by Year
bg: Филтрирай по година

source: Movies
bg: Филми

source: No new movies found today
bg: Няма филми намерени днес

source: Movies from Arenabg.com, Zamunda.net, Zelka.org, P2pbg.com, Energy-torrent.com and Alein.org
bg: Филми от Arenabg.com, Zamunda.net, Zelka.org, P2pbg.com, Energy-torrent.com и Alein.org

source: Result for
bg: Резултати за

source: The search works with titles, imdbids and artists. Some of the results might be duplicated, as the search returns torrents from all trackers.
bg: Търсачката работи с заглавия, имена на артисти или imdbid. Някой от резултатите може да се дублират, защото се показват резултати от всички индексирани сайтове.

source: Torrents found
bg: Намерени торенти

source: No results found for
bg: Няма резултати за

source: TV Series from Arenabg.com, Zamunda.net, Zelka.org, P2pbg.com, Energy-torrent.com and Alein.org
bg: ТВ сериали от Arenabg.com, Zamunda.net, Zelka.org, P2pbg.com, Energytorrent.com и Alein.org

source: Search
bg: Търси
